app/controllers/faculties_controller.rb

  def index
    @faculties = Faculty.all
---
SELECT `faculties`.* FROM `faculties`

  def create
    @faculty = Faculty.new(faculty_params)

    respond_to do |format|
      if @faculty.save
---
INSERT INTO `faculties` (`education`, `experience`, `aoi`, `created_at`, `updated_at`) VALUES ('chinnmay', '101', 'rails 5', '2017-06-05 04:42:29', '2017-06-05 04:42:29')

    def set_faculty
      @faculty = Faculty.find(params[:id])
---
SELECT  `faculties`.* FROM `faculties` WHERE `faculties`.`id` = 1 LIMIT 1